IDEA Open Model
ReinfBarByPolyline.BarShape Property
Compatible with IDEA StatiCa 20.1
 Polyline representing shape of bar
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public ReferenceElement BarShape { get; set; }
Public Property BarShape As ReferenceElement
	Get
	Set
Property Value
Type: ReferenceElement
See Also
Reference
ReinfBarByPolyline Class
IdeaRS.OpenModel.Detail Namespace